app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-02-23 19:39:31.002265"], ["name", "Ipad"], ["price", "22000"], ["updated_at", "2016-02-23 19:39:31.002265"]]
---
	def create
		@product =  Product.new(product_params)
		if @product.save

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@article = Product.find(params[:id])

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["price", "30"], ["updated_at", "2016-02-23 20:26:29.333919"]]
---
	def update
		@product = Product.find(params[:id])

		if @product.update(product_params)